00test/Laser_3D_refer_3gmin_newmesh/constant/turbulenceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    model            realizableKE;
    printCoeffs      on;

    realizableKECoeffs
    {
        C2          1.9;
        sigmak      1.0;
        sigmaEps    1.2;
        A0          4.0;
    }
}

// ************************************************************************* //
