00test/Laser_3D_refer_3gmin_newmesh/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run and clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions
. $WM_PROJECT_DIR/bin/tools/CleanFunctions

cleanCase

runApplication blockMesh

runApplication decomposePar

runApplication mpirun -np 8 LaserDPMFoam -parallel


#------------------------------------------------------------------------------
